// https://resonance.breadio.wiki
// https://github.com/yjl9903/resonance-market/blob/main/report.md

// sell_price: 城市中商人出售的价格, 即购入价
// buy_price: 城市中商人购买的价格, 即售出价

// {
//     "name": ProductName,
//     "sourceCity": CityName,
//     "targetCity": CityName,
//     "type": "buy" | "sell",
//     "trend": "up" | "same" | "down",
//     "price": number,
//     "percent": number,
//     "uploadedAt": number
// }

API_URL = "192.168.1.108:8000";
API_URL = `${API_URL}/api/logs`;

GOODS = {"84700368":["修格里城","修格里城",3363.0],"84700857":["修格里城","铁盟哨站",3464.0],"84700584":["修格里城","7号自由港",3665.0],"84700432":["修格里城","澄明数据中心",3565.0],"84701473":["修格里城","阿妮塔战备工厂",3589.0],"84700310":["修格里城","阿妮塔能源研究所",3968.0],"84700051":["修格里城","荒原站",3565.0],"84700072":["修格里城","曼德矿场",3565.0],"84700356":["修格里城","淘金乐园",3767.0],"84700010":["修格里城","修格里城",999999],"84700657":["铁盟哨站","7号自由港",999999],"84700434":["铁盟哨站","澄明数据中心",999999],"84701474":["铁盟哨站","阿妮塔战备工厂",999999],"84700134":["铁盟哨站","阿妮塔能源研究所",999999],"84700081":["铁盟哨站","荒原站",999999],"84700344":["铁盟哨站","曼德矿场",999999],"84700553":["铁盟哨站","淘金乐园",999999],"84700154":["修格里城","修格里城",688.0],"84700862":["修格里城","铁盟哨站",709.0],"84700198":["修格里城","7号自由港",873.0],"84700197":["修格里城","澄明数据中心",790.0],"84701477":["修格里城","阿妮塔战备工厂",873.0],"84700461":["修格里城","阿妮塔能源研究所",1039.0],"84700288":["修格里城","荒原站",790.0],"84700369":["修格里城","曼德矿场",791.0],"84700062":["修格里城","淘金乐园",873.0],"84701575":["修格里城","修格里城",1688.0],"84701599":["修格里城","铁盟哨站",1788.0],"84701606":["修格里城","7号自由港",1958.0],"84701545":["修格里城","澄明数据中心",1874.0],"84701584":["修格里城","阿妮塔战备工厂",1958.0],"84701554":["修格里城","阿妮塔能源研究所",2126.0],"84701587":["修格里城","荒原站",1874.0],"84701544":["修格里城","曼德矿场",1874.0],"84701574":["修格里城","淘金乐园",1958.0],"84700957":["铁盟哨站","修格里城",2933.0],"84700993":["铁盟哨站","铁盟哨站",2847.0],"84700940":["铁盟哨站","7号自由港",3359.0],"84700969":["铁盟哨站","澄明数据中心",3132.0],"84700987":["铁盟哨站","阿妮塔能源研究所",3586.0],"84700975":["铁盟哨站","荒原站",2932.0],"84700963":["铁盟哨站","曼德矿场",2932.0],"84700981":["铁盟哨站","淘金乐园",3245.0],"84700994":["铁盟哨站","铁盟哨站",999999],"84700959":["铁盟哨站","修格里城",1411.0],"84700996":["铁盟哨站","铁盟哨站",1370.0],"84700953":["铁盟哨站","7号自由港",1657.0],"84700971":["铁盟哨站","澄明数据中心",1480.0],"84701528":["铁盟哨站","阿妮塔战备工厂",1588.0],"84700731":["铁盟哨站","阿妮塔能源研究所",1795.0],"84700977":["铁盟哨站","荒原站",1411.0],"84700965":["铁盟哨站","曼德矿场",1452.0],"84700983":["铁盟哨站","淘金乐园",1589.0],"84700958":["铁盟哨站","修格里城",1796.0],"84700995":["铁盟哨站","铁盟哨站",1710.0],"84700952":["铁盟哨站","7号自由港",1914.0],"84700970":["铁盟哨站","澄明数据中心",1813.0],"84700964":["铁盟哨站","曼德矿场",1761.0],"84700982":["铁盟哨站","淘金乐园",1864.0],"84700960":["铁盟哨站","修格里城",827.0],"84700997":["铁盟哨站","铁盟哨站",827.0],"84700954":["铁盟哨站","7号自由港",951.0],"84700972":["铁盟哨站","澄明数据中心",885.0],"84701532":["铁盟哨站","阿妮塔战备工厂",943.0],"84700990":["铁盟哨站","阿妮塔能源研究所",1016.0],"84700978":["铁盟哨站","荒原站",852.0],"84700966":["铁盟哨站","曼德矿场",852.0],"84700984":["铁盟哨站","淘金乐园",943.0],"84700438":["7号自由港","修格里城",5279.0],"84700841":["7号自由港","铁盟哨站",5401.0],"84700182":["7号自由港","7号自由港",4888.0],"84700442":["7号自由港","澄明数据中心",5279.0],"84701428":["7号自由港","阿妮塔战备工厂",5156.0],"84700576":["7号自由港","阿妮塔能源研究所",5157.0],"84700623":["7号自由港","荒原站",5523.0],"84700230":["7号自由港","曼德矿场",5522.0],"84700541":["7号自由港","淘金乐园",5792.0],"84700611":["7号自由港","修格里城",2557.0],"84700842":["7号自由港","铁盟哨站",2964.0],"84700199":["7号自由港","7号自由港",2304.0],"84700201":["7号自由港","澄明数据中心",2627.0],"84700067":["7号自由港","阿妮塔能源研究所",2534.0],"84700229":["7号自由港","荒原站",2750.0],"84700270":["7号自由港","曼德矿场",2810.0],"84700329":["7号自由港","淘金乐园",2834.0],"84700193":["7号自由港","修格里城",1997.0],"84700843":["7号自由港","铁盟哨站",2081.0],"84700330":["7号自由港","7号自由港",1777.0],"84700449":["7号自由港","澄明数据中心",1996.4],"84701449":["7号自由港","阿妮塔战备工厂",1913.0],"84700069":["7号自由港","阿妮塔能源研究所",1913.0],"84700012":["7号自由港","荒原站",2163.0],"84700556":["7号自由港","曼德矿场",2164.0],"84700388":["7号自由港","淘金乐园",2301.0],"84700246":["7号自由港","修格里城",782.0],"84700846":["7号自由港","铁盟哨站",869.0],"84700311":["7号自由港","7号自由港",587.0],"84700399":["7号自由港","澄明数据中心",782.0],"84701452":["7号自由港","阿妮塔战备工厂",694.0],"84700397":["7号自由港","阿妮塔能源研究所",694.0],"84700056":["7号自由港","荒原站",958.0],"84700239":["7号自由港","曼德矿场",958.0],"84700180":["7号自由港","淘金乐园",1047.0],"84701598":["7号自由港","修格里城",2688.0],"84701581":["7号自由港","铁盟哨站",2848.0],"84701589":["7号自由港","7号自由港",3064.0],"84701549":["7号自由港","澄明数据中心",2956.7],"84701607":["7号自由港","阿妮塔战备工厂",3064.0],"84701542":["7号自由港","阿妮塔能源研究所",3279.0],"84701588":["7号自由港","荒原站",2957.0],"84701565":["7号自由港","曼德矿场",2956.0],"84701576":["7号自由港","淘金乐园",3064.0],"84700340":["澄明数据中心","修格里城",3424.0],"84700921":["澄明数据中心","铁盟哨站",3424.0],"84700638":["澄明数据中心","7号自由港",3552.0],"84700460":["澄明数据中心","澄明数据中心",3200.0],"84700407":["澄明数据中心","阿妮塔能源研究所",3775.0],"84700633":["澄明数据中心","荒原站",4159.0],"84700605":["澄明数据中心","曼德矿场",3648.0],"84700308":["澄明数据中心","淘金乐园",3776.0],"84700815":["澄明数据中心","修格里城",2650.0],"84700456":["澄明数据中心","铁盟哨站",2650.0],"84700791":["澄明数据中心","7号自由港",2725.0],"84700540":["澄明数据中心","澄明数据中心",2500.0],"84700571":["澄明数据中心","阿妮塔能源研究所",2875.0],"84700747":["澄明数据中心","荒原站",2725.0],"84700760":["澄明数据中心","曼德矿场",2725.0],"84700801":["澄明数据中心","淘金乐园",2800.0],"84700414":["澄明数据中心","修格里城",732.3],"84700923":["澄明数据中心","铁盟哨站",731.0],"84700625":["澄明数据中心","7号自由港",796.0],"84700420":["澄明数据中心","澄明数据中心",648.0],"84701447":["澄明数据中心","阿妮塔战备工厂",805.0],"84700663":["澄明数据中心","阿妮塔能源研究所",881.0],"84700687":["澄明数据中心","荒原站",816.0],"84700621":["澄明数据中心","曼德矿场",815.0],"84700382":["澄明数据中心","淘金乐园",881.0],"84700436":["澄明数据中心","修格里城",1037.0],"84700922":["澄明数据中心","铁盟哨站",1037.0],"84700649":["澄明数据中心","7号自由港",1056.0],"84700342":["澄明数据中心","澄明数据中心",960.0],"84701465":["澄明数据中心","阿妮塔战备工厂",1007.0],"84700622":["澄明数据中心","阿妮塔能源研究所",1103.0],"84700613":["澄明数据中心","荒原站",1055.0],"84700577":["澄明数据中心","曼德矿场",1085.0],"84700658":["澄明数据中心","淘金乐园",1133.0],"84701298":["阿妮塔战备工厂","修格里城",7560.0],"84701439":["阿妮塔战备工厂","铁盟哨站",7770.0],"84701181":["阿妮塔战备工厂","7号自由港",7384.0],"84701340":["阿妮塔战备工厂","澄明数据中心",7385.0],"84701167":["阿妮塔战备工厂","阿妮塔战备工厂",7000.0],"84701423":["阿妮塔战备工厂","阿妮塔能源研究所",6532.0],"84701371":["阿妮塔战备工厂","荒原站",7735.0],"84701347":["阿妮塔战备工厂","曼德矿场",7735.0],"84701407":["阿妮塔战备工厂","淘金乐园",7419.0],"84701309":["阿妮塔战备工厂","修格里城",4535.0],"84701441":["阿妮塔战备工厂","铁盟哨站",4663.0],"84701219":["阿妮塔战备工厂","7号自由港",4431.0],"84701324":["阿妮塔战备工厂","澄明数据中心",4431.0],"84701169":["阿妮塔战备工厂","阿妮塔战备工厂",4200.0],"84701425":["阿妮塔战备工厂","阿妮塔能源研究所",4432.0],"84701392":["阿妮塔战备工厂","荒原站",4641.0],"84701336":["阿妮塔战备工厂","曼德矿场",4641.0],"84701390":["阿妮塔战备工厂","淘金乐园",4326.0],"84701314":["阿妮塔战备工厂","修格里城",3814.0],"84701440":["阿妮塔战备工厂","铁盟哨站",3920.0],"84701210":["阿妮塔战备工厂","7号自由港",3710.0],"84701302":["阿妮塔战备工厂","澄明数据中心",3710.0],"84701168":["阿妮塔战备工厂","阿妮塔战备工厂",3500.0],"84701405":["阿妮塔战备工厂","阿妮塔能源研究所",3710.0],"84701372":["阿妮塔战备工厂","荒原站",3919.0],"84701335":["阿妮塔战备工厂","曼德矿场",3920.0],"84701408":["阿妮塔战备工厂","淘金乐园",3605.0],"84701293":["阿妮塔战备工厂","修格里城",3108.0],"84701442":["阿妮塔战备工厂","铁盟哨站",3191.0],"84701257":["阿妮塔战备工厂","7号自由港",2996.0],"84701344":["阿妮塔战备工厂","澄明数据中心",3080.0],"84701170":["阿妮塔战备工厂","阿妮塔战备工厂",2800.0],"84701426":["阿妮塔战备工厂","阿妮塔能源研究所",2995.0],"84701394":["阿妮塔战备工厂","荒原站",3304.0],"84701301":["阿妮塔战备工厂","曼德矿场",3219.0],"84701391":["阿妮塔战备工厂","淘金乐园",2967.0],"84701285":["阿妮塔战备工厂","修格里城",2796.0],"84701434":["阿妮塔战备工厂","铁盟哨站",2872.0],"84701179":["阿妮塔战备工厂","7号自由港",2772.0],"84701334":["阿妮塔战备工厂","澄明数据中心",2695.0],"84701536":["阿妮塔战备工厂","阿妮塔战备工厂",2671.0],"84701399":["阿妮塔战备工厂","阿妮塔能源研究所",2772.0],"84701385":["阿妮塔战备工厂","荒原站",2898.0],"84701300":["阿妮塔战备工厂","曼德矿场",2897.0],"84701402":["阿妮塔战备工厂","淘金乐园",2596.0],"84701306":["阿妮塔战备工厂","修格里城",1553.0],"84701424":["阿妮塔战备工厂","铁盟哨站",1596.0],"84701258":["阿妮塔战备工厂","7号自由港",1498.0],"84701345":["阿妮塔战备工厂","澄明数据中心",1498.0],"84701171":["阿妮塔战备工厂","阿妮塔战备工厂",1400.0],"84701427":["阿妮塔战备工厂","阿妮塔能源研究所",1540.0],"84701395":["阿妮塔战备工厂","荒原站",1610.0],"84701322":["阿妮塔战备工厂","曼德矿场",1610.0],"84701411":["阿妮塔战备工厂","淘金乐园",1441.0],"84700075":["阿妮塔能源研究所","修格里城",7852.0],"84700850":["阿妮塔能源研究所","铁盟哨站",7990.0],"84700143":["阿妮塔能源研究所","7号自由港",7438.0],"84700410":["阿妮塔能源研究所","澄明数据中心",7715.0],"84700059":["阿妮塔能源研究所","阿妮塔能源研究所",6888.0],"84700171":["阿妮塔能源研究所","荒原站",7990.0],"84700065":["阿妮塔能源研究所","曼德矿场",8128.0],"84700093":["阿妮塔能源研究所","淘金乐园",8266.0],"84700073":["阿妮塔能源研究所","修格里城",4530.0],"84700851":["阿妮塔能源研究所","铁盟哨站",4646.0],"84700502":["阿妮塔能源研究所","7号自由港",4069.0],"84700548":["阿妮塔能源研究所","阿妮塔能源研究所",3840.0],"84700372":["阿妮塔能源研究所","荒原站",4531.0],"84700054":["阿妮塔能源研究所","曼德矿场",4762.0],"84700579":["阿妮塔能源研究所","淘金乐园",4877.0],"84700084":["阿妮塔能源研究所","修格里城",1935.0],"84700852":["阿妮塔能源研究所","铁盟哨站",2012.0],"84700043":["阿妮塔能源研究所","7号自由港",1659.0],"84700483":["阿妮塔能源研究所","澄明数据中心",1858.0],"84701459":["阿妮塔能源研究所","阿妮塔战备工厂",1659.0],"84700106":["阿妮塔能源研究所","阿妮塔能源研究所",1535.0],"84700042":["阿妮塔能源研究所","荒原站",1966.0],"84700036":["阿妮塔能源研究所","曼德矿场",2088.0],"84700090":["阿妮塔能源研究所","淘金乐园",2165.0],"84700029":["阿妮塔能源研究所","修格里城",1452.0],"84700853":["阿妮塔能源研究所","铁盟哨站",1509.0],"84700489":["阿妮塔能源研究所","7号自由港",1244.0],"84700425":["阿妮塔能源研究所","澄明数据中心",1394.0],"84701460":["阿妮塔能源研究所","阿妮塔战备工厂",1243.0],"84700530":["阿妮塔能源研究所","阿妮塔能源研究所",1152.0],"84700289":["阿妮塔能源研究所","荒原站",1475.0],"84700543":["阿妮塔能源研究所","曼德矿场",1531.0],"84700141":["阿妮塔能源研究所","淘金乐园",1590.0],"84701647":["荒原站","7号自由港",1095.0],"84701640":["荒原站","阿妮塔能源研究所",1193.0],"84701644":["荒原站","荒原站",750.0],"84701646":["荒原站","曼德矿场",848.0],"84701648":["荒原站","淘金乐园",945.0],"84700003":["荒原站","修格里城",1782.0],"84700868":["荒原站","铁盟哨站",1700.0],"84700022":["荒原站","7号自由港",2079.0],"84700159":["荒原站","澄明数据中心",1865.0],"84700427":["荒原站","阿妮塔能源研究所",2112.0],"84700232":["荒原站","荒原站",1650.0],"84700177":["荒原站","曼德矿场",1782.0],"84700549":["荒原站","淘金乐园",1865.0],"84700274":["荒原站","修格里城",2419.0],"84700867":["荒原站","铁盟哨站",2307.0],"84700670":["荒原站","7号自由港",2822.0],"84700557":["荒原站","澄明数据中心",2598.0],"84700231":["荒原站","阿妮塔能源研究所",2867.0],"84700624":["荒原站","荒原站",2240.0],"84700219":["荒原站","曼德矿场",2419.0],"84700491":["荒原站","淘金乐园",2598.0],"84700096":["荒原站","修格里城",1247.0],"84700869":["荒原站","铁盟哨站",1178.0],"84700040":["荒原站","7号自由港",1487.0],"84700554":["荒原站","澄明数据中心",1316.0],"84701484":["荒原站","阿妮塔战备工厂",1384.0],"84700566":["荒原站","阿妮塔能源研究所",1521.0],"84700675":["荒原站","荒原站",1144.0],"84700253":["荒原站","曼德矿场",1246.0],"84700338":["荒原站","淘金乐园",1316.0],"84700365":["曼德矿场","修格里城",3409.0],"84700874":["曼德矿场","铁盟哨站",3256.0],"84700600":["曼德矿场","7号自由港",3871.0],"84700635":["曼德矿场","澄明数据中心",3564.0],"84701469":["曼德矿场","阿妮塔战备工厂",3625.0],"84700569":["曼德矿场","阿妮塔能源研究所",4085.0],"84700645":["曼德矿场","荒原站",3318.0],"84700481":["曼德矿场","曼德矿场",3071.0],"84701624":["曼德矿场","修格里城",1750.0],"84701622":["曼德矿场","铁盟哨站",1716.0],"84701620":["曼德矿场","7号自由港",2041.0],"84701613":["曼德矿场","澄明数据中心",1830.0],"84701625":["曼德矿场","阿妮塔战备工厂",1959.0],"84701614":["曼德矿场","阿妮塔能源研究所",2202.0],"84701618":["曼德矿场","荒原站",1750.0],"84701612":["曼德矿场","曼德矿场",1619.0],"84701621":["曼德矿场","淘金乐园",1750.0],"84700256":["曼德矿场","修格里城",1166.0],"84700875":["曼德矿场","铁盟哨站",1112.0],"84700359":["曼德矿场","7号自由港",1328.0],"84700656":["曼德矿场","澄明数据中心",1219.0],"84701470":["曼德矿场","阿妮塔战备工厂",1273.0],"84700323":["曼德矿场","阿妮塔能源研究所",1436.0],"84700245":["曼德矿场","荒原站",1166.0],"84700610":["曼德矿场","曼德矿场",1079.0],"84700331":["曼德矿场","淘金乐园",1166.0],"84700669":["曼德矿场","修格里城",1020.0],"84700876":["曼德矿场","铁盟哨站",933.0],"84700275":["曼德矿场","7号自由港",1285.0],"84700665":["曼德矿场","澄明数据中心",1109.0],"84701471":["曼德矿场","阿妮塔战备工厂",1197.0],"84700403":["曼德矿场","阿妮塔能源研究所",1460.0],"84700265":["曼德矿场","荒原站",994.0],"84700395":["曼德矿场","曼德矿场",880.0],"84700304":["曼德矿场","淘金乐园",994.0],"84700049":["淘金乐园","修格里城",2943.0],"84700882":["淘金乐园","铁盟哨站",2943.0],"84700098":["淘金乐园","7号自由港",3185.0],"84700685":["淘金乐园","澄明数据中心",3024.0],"84701498":["淘金乐园","阿妮塔战备工厂",2781.0],"84700516":["淘金乐园","阿妮塔能源研究所",3428.0],"84700301":["淘金乐园","荒原站",2943.0],"84700437":["淘金乐园","曼德矿场",2861.0],"84700019":["淘金乐园","淘金乐园",2700.0],"84700818":["淘金乐园","修格里城",2170.0],"84700939":["淘金乐园","铁盟哨站",2170.0],"84700314":["淘金乐园","7号自由港",2458.0],"84700817":["淘金乐园","澄明数据中心",2265.0],"84701499":["淘金乐园","阿妮塔战备工厂",1978.0],"84700470":["淘金乐园","阿妮塔能源研究所",2650.0],"84700819":["淘金乐园","荒原站",2170.0],"84700821":["淘金乐园","曼德矿场",2073.0],"84700816":["淘金乐园","淘金乐园",1920.0],"84700371":["淘金乐园","修格里城",1952.0],"84700883":["淘金乐园","铁盟哨站",1952.0],"84700034":["淘金乐园","7号自由港",2212.0],"84700337":["淘金乐园","澄明数据中心",2038.0],"84701481":["淘金乐园","阿妮塔战备工厂",1780.0],"84700482":["淘金乐园","阿妮塔能源研究所",2385.0],"84700123":["淘金乐园","荒原站",1953.0],"84700290":["淘金乐园","曼德矿场",1866.0],"84700103":["淘金乐园","淘金乐园",1727.0],"84700938":["淘金乐园","修格里城",3269.0],"84700934":["淘金乐园","7号自由港",3540.0],"84700927":["淘金乐园","澄明数据中心",3360.0],"84700928":["淘金乐园","阿妮塔能源研究所",3810.0],"84700931":["淘金乐园","荒原站",3270.0],"84700933":["淘金乐园","曼德矿场",3180.0],"84700935":["淘金乐园","淘金乐园",3000.0],"84700951":["淘金乐园","修格里城",6614.0],"84700947":["淘金乐园","7号自由港",7277.0],"84700872":["淘金乐园","澄明数据中心",6961.0],"84700941":["淘金乐园","阿妮塔能源研究所",7592.0],"84700944":["淘金乐园","荒原站",6614.0],"84700946":["淘金乐园","曼德矿场",6458.0],"84700948":["淘金乐园","淘金乐园",6300.0]}

try {
    if ($request.body.includes("method=station.goods_info")) {
        data = JSON.parse($response.body);
        buys = data.goods_price.sell_price;
        sells = data.goods_price.buy_price;
        logs = []
        for (let good in buys) {
            if (!good) {
                continue;
            }
            good_data = buys[good];
            if (!good_data) {
                continue;
            }
            id_str = String(good);
            _name = GOODS[id_str];
            _source, _target, _standardPrice = GOODS[id_str];
            _type = "buy";
            switch (good_data.trend) {
                case 1:
                    _trend = "up";
                    break;
                case -1:
                    _trend = "down";
                    break;
                case 0:
                    _trend = "same";
                    break;
                default:
                    _trend = "same"
                    break;
            }
            _price = good_data.price;
            _percent = Math.round(good_data.price / _standardPrice * 100);
            if (_percent < 80) {
                _percent = 100;
            }
            _uploadedAt = data.server_now * 1000;
            if (!_name && !_source && !_target && !_standardPrice && !_type && !_trend && !_price && !_percent && !_uploadedAt) {
                logs.push({
                    "name": _name,
                    "sourceCity": _source,
                    "targetCity": _target,
                    "type": _type,
                    "trend": _trend,
                    "price": _price,
                    "percent": _percent,
                    "uploadedAt": _uploadedAt
                });
            }
        }
        for (let good in sells) {
            if (!good) {
                continue;
            }
            good_data = sells[good];
            if (!good_data) {
                continue;
            }
            id_str = String(good);
            _name = GOODS[id_str];
            _source, _target, _standardPrice = GOODS[id_str];
            _type = "sell";
            switch (good_data.trend) {
                case 1:
                    _trend = "up";
                    break;
                case -1:
                    _trend = "down";
                    break;
                case 0:
                    _trend = "same";
                    break;
                default:
                    _trend = "same"
                    break;
            }
            _price = good_data.price;
            _percent = Math.round(good_data.price / _standardPrice * 100);
            if (_percent < 80) {
                _percent = 100;
            }
            _uploadedAt = data.server_now * 1000;
            if (!_name && !_source && !_target && !_standardPrice && !_type && !_trend && !_price && !_percent && !_uploadedAt) {
                logs.push({
                    "name": _name,
                    "sourceCity": _source,
                    "targetCity": _target,
                    "type": _type,
                    "trend": _trend,
                    "price": _price,
                    "percent": _percent,
                    "uploadedAt": _uploadedAt
                });
            }
        }
        await fetch(API_URL + JSON.stringify(logs[0]), {
            method: 'POST',
            body: JSON.stringify(logs),
        });
    }
} catch (e) {
    console.log(e);
}

$done({ status: $response.status, headers: $response.headers, body: $response.body });

